Revit.Elements.FilledRegion
Revit filled Region

Revit.Elements.FilledRegion.InternalRevitElement
Internal reference to the Revit Element

Revit.Elements.FilledRegion.InternalElement
Reference to the Element

Revit.Elements.FilledRegion.InternalSetElement(Autodesk.Revit.DB.FilledRegion)
Set the internal Element, ElementId, and UniqueId

Revit.Elements.FilledRegion.#ctor(Autodesk.Revit.DB.FilledRegion)
Constructor
FilledRegion:

Revit.Elements.FilledRegion.#ctor(Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,System.Collections.Generic.List{Autodesk.Revit.DB.CurveLoop})
Create Filled Region by Curves
view:
typeId:
boundary:

Revit.Elements.FilledRegion.InitElement(Autodesk.Revit.DB.FilledRegion)
Init element
element:

Revit.Elements.FilledRegion.Init(Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.CurveLoop})
Init Filled Region by Curves
view:
typeId:
boundary:

Revit.Elements.FilledRegion.ByCurves(Revit.Elements.Views.View,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Revit.Elements.FilledRegionType)
Construct a Revit FilledRegion element by Curves
view: View to place filled region on
boundary: Boundary curves
regionType: Region Type
Returns: